---
kind: method
id: M:Autodesk.Revit.DB.LeaderArray.Insert(Autodesk.Revit.DB.Leader,System.Int32)
source: html/e903129b-ad73-f4ed-3f2f-d39491cf41b0.htm
---
# Autodesk.Revit.DB.LeaderArray.Insert Method

Insert the specified item into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	Leader item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Leader`) - The item to be inserted into the array.
- **index** (`System.Int32`) - The item will be inserted before this index.

## Returns
Returns whether the item was inserted into the array.